In [4]:
import pandas as pd
import numpy as np
import scipy as sp

In [8]:
df=pd.read_csv("sales_data.csv")

In [9]:
df.head()

,invoice_no,customer_id,category,quantity,price,invoice_date,shopping_mall
0,I138884,C241288,Clothing,5,1500.40,05-08-2022,Kanyon
1,I317333,C111565,Shoes,3,1800.51,12-12-2021,Forum Istanbul
2,I127801,C266599,Clothing,1,300.08,09-11-2021,Metrocity
3,I173702,C988172,Shoes,5,3000.85,16-05-2021,Metropol AVM
4,I337046,C189076,Books,4,60.60,24-10-2021,Kanyon

In [11]:
df.columns

Index(['invoice_no', 'customer_id', 'category', 'quantity', 'price',
       'invoice_date', 'shopping_mall'],
      dtype='object')

In [12]:
df.isnull().sum()

invoice_no       0
customer_id      0
category         0
quantity         0
price            0
invoice_date     0
shopping_mall    0
dtype: int64

In [13]:
df.describe()

           quantity         price
count  99457.000000  99457.000000
mean       3.003429    689.256321
std        1.413025    941.184567
min        1.000000      5.230000
25%        2.000000     45.450000
50%        3.000000    203.300000
75%        4.000000   1200.320000
max        5.000000   5250.000000

In [15]:
df.shape

(99457, 7)

In [16]:
df.info

<bound method DataFrame.info of       invoice_no customer_id         category  quantity    price invoice_date  \
0        I138884     C241288         Clothing         5  1500.40   05-08-2022
1        I317333     C111565            Shoes         3  1800.51   12-12-2021
2        I127801     C266599         Clothing         1   300.08   09-11-2021
3        I173702     C988172            Shoes         5  3000.85   16-05-2021
4        I337046     C189076            Books         4    60.60   24-10-2021
...          ...         ...              ...       ...      ...          ...
99452    I219422     C441542         Souvenir         5    58.65   21-09-2022
99453    I325143     C569580  Food & Beverage         2    10.46   22-09-2021
99454    I824010     C103292  Food & Beverage         2    10.46   28-03-2021
99455    I702964     C800631       Technology         4  4200.00   16-03-2021
99456    I232867     C273973         Souvenir         3    35.19   15-10-2022

          shopping_mall
0                Kanyon
1        Forum Istanbul
2             Metrocity
3          Metropol AVM
4                Kanyon
...                 ...
99452            Kanyon
99453    Forum Istanbul
99454         Metrocity
99455      Istinye Park
99456  Mall of Istanbul

[99457 rows x 7 columns]>

In [17]:
df.tail

<bound method NDFrame.tail of       invoice_no customer_id         category  quantity    price invoice_date  \
0        I138884     C241288         Clothing         5  1500.40   05-08-2022
1        I317333     C111565            Shoes         3  1800.51   12-12-2021
2        I127801     C266599         Clothing         1   300.08   09-11-2021
3        I173702     C988172            Shoes         5  3000.85   16-05-2021
4        I337046     C189076            Books         4    60.60   24-10-2021
...          ...         ...              ...       ...      ...          ...
99452    I219422     C441542         Souvenir         5    58.65   21-09-2022
99453    I325143     C569580  Food & Beverage         2    10.46   22-09-2021
99454    I824010     C103292  Food & Beverage         2    10.46   28-03-2021
99455    I702964     C800631       Technology         4  4200.00   16-03-2021
99456    I232867     C273973         Souvenir         3    35.19   15-10-2022

          shopping_mall
0                Kanyon
1        Forum Istanbul
2             Metrocity
3          Metropol AVM
4                Kanyon
...                 ...
99452            Kanyon
99453    Forum Istanbul
99454         Metrocity
99455      Istinye Park
99456  Mall of Istanbul

[99457 rows x 7 columns]>

In [18]:
df.loc[0]

invoice_no          I138884
customer_id         C241288
category           Clothing
quantity                  5
price                1500.4
invoice_date     05-08-2022
shopping_mall        Kanyon
Name: 0, dtype: object

In [19]:
df.iloc[0,0]

'I138884'

In [20]:
df.iloc[[3,4]]

,invoice_no,customer_id,category,quantity,price,invoice_date,shopping_mall
3,I173702,C988172,Shoes,5,3000.85,16-05-2021,Metropol AVM
4,I337046,C189076,Books,4,60.60,24-10-2021,Kanyon

In [22]:
x=df.iloc[:,:-1]
x

      invoice_no customer_id         category  quantity    price invoice_date
0        I138884     C241288         Clothing         5  1500.40   05-08-2022
1        I317333     C111565            Shoes         3  1800.51   12-12-2021
2        I127801     C266599         Clothing         1   300.08   09-11-2021
3        I173702     C988172            Shoes         5  3000.85   16-05-2021
4        I337046     C189076            Books         4    60.60   24-10-2021
...          ...         ...              ...       ...      ...          ...
99452    I219422     C441542         Souvenir         5    58.65   21-09-2022
99453    I325143     C569580  Food & Beverage         2    10.46   22-09-2021
99454    I824010     C103292  Food & Beverage         2    10.46   28-03-2021
99455    I702964     C800631       Technology         4  4200.00   16-03-2021
99456    I232867     C273973         Souvenir         3    35.19   15-10-2022

[99457 rows x 6 columns]

In [24]:
y=df.iloc[:,6]
y

0                  Kanyon
1          Forum Istanbul
2               Metrocity
3            Metropol AVM
4                  Kanyon
               ...
99452              Kanyon
99453      Forum Istanbul
99454           Metrocity
99455        Istinye Park
99456    Mall of Istanbul
Name: shopping_mall, Length: 99457, dtype: object

In [42]:
from sklearn.preprocessing import MinMaxScaler

In [44]:
from sklearn.preprocessing import LabelEncoder

In [45]:
y=LabelEncoder().fit_transform(y)

In [46]:
y=pd.DataFrame(y)

In [47]:
y.head()

   0
0  4
1  2
2  6
3  7
4  4

In [48]:
numeric_features=x.select_dtypes('number')

In [58]:
categorical_features=x.select_dtypes('object')

In [59]:
categorical_features

      invoice_no customer_id         category invoice_date
0        I138884     C241288         Clothing   05-08-2022
1        I317333     C111565            Shoes   12-12-2021
2        I127801     C266599         Clothing   09-11-2021
3        I173702     C988172            Shoes   16-05-2021
4        I337046     C189076            Books   24-10-2021
...          ...         ...              ...          ...
99452    I219422     C441542         Souvenir   21-09-2022
99453    I325143     C569580  Food & Beverage   22-09-2021
99454    I824010     C103292  Food & Beverage   28-03-2021
99455    I702964     C800631       Technology   16-03-2021
99456    I232867     C273973         Souvenir   15-10-2022

[99457 rows x 4 columns]

In [52]:
numeric_features

       quantity    price
0             5  1500.40
1             3  1800.51
2             1   300.08
3             5  3000.85
4             4    60.60
...         ...      ...
99452         5    58.65
99453         2    10.46
99454         2    10.46
99455         4  4200.00
99456         3    35.19

[99457 rows x 2 columns]

In [62]:
y.head

<bound method NDFrame.head of        0
0      4
1      2
2      6
3      7
4      4
...   ..
99452  4
99453  2
99454  6
99455  3
99456  5

[99457 rows x 1 columns]>

In [63]:
df.shape

(99457, 7)

In [61]:
x.head

<bound method NDFrame.head of       invoice_no customer_id         category  quantity    price invoice_date
0        I138884     C241288         Clothing         5  1500.40   05-08-2022
1        I317333     C111565            Shoes         3  1800.51   12-12-2021
2        I127801     C266599         Clothing         1   300.08   09-11-2021
3        I173702     C988172            Shoes         5  3000.85   16-05-2021
4        I337046     C189076            Books         4    60.60   24-10-2021
...          ...         ...              ...       ...      ...          ...
99452    I219422     C441542         Souvenir         5    58.65   21-09-2022
99453    I325143     C569580  Food & Beverage         2    10.46   22-09-2021
99454    I824010     C103292  Food & Beverage         2    10.46   28-03-2021
99455    I702964     C800631       Technology         4  4200.00   16-03-2021
99456    I232867     C273973         Souvenir         3    35.19   15-10-2022

[99457 rows x 6 columns]>